[{"dt":"2013-08-29T05:31:30Z","t":["rtw"],"a":"kyleobrien","n":"Costs more and tastes worse. Not a surprise. But here's the interesting part. John Sylvan, the man who created the Keurig system:\r\n\r\n>\"I feel kind of guilty. The world's changed in fifteen years.\" He told me he's proud he created something that's so well loved, but \"hindsight's 20/20,\" he said. \"I wouldn't do it now.\"","d":"Waste: The Dark Side of the New Coffee Craze","u":"http://www.eastbayexpress.com/oakland/waste-the-dark-side-of-the-new-coffee-craze/Content?oid=3687220&showFullText=true"},{"dt":"2013-08-29T05:34:26Z","t":["rtw"],"a":"kyleobrien","n":">What most sets this city of 30,000 apart from many of its neighbors these days is what is absent: fear for its future.\r\n>\r\n>Led by a young mayor with an inspiring back story and an idealist’s approach — he talks about sidewalks in philosophical terms — Ithaca is the upstate exception: a successful liberal enclave in a largely conservative region troubled by unemployment woes, declining or stagnant population, and post-Detroit talk of bankruptcy.\r\n>\r\n>“It’s like a little San Francisco,” Nicole Roulstin, 32, an Ithaca resident, said recently, “or the Berkeley of the East.”","d":"Colleges Help Ithaca Thrive in a Region of Struggles","u":"http://www.nytimes.com/2013/08/05/nyregion/with-education-as-economic-engine-ithaca-thrives-in-struggling-region.html?hp&_r=4&"},{"dt":"2013-08-29T16:45:42Z","t":["rtw"],"a":"kyleobrien","n":">All 12 were machine-gunned down by a firing squad three days later, while members of their immediate family were forced to watch, the paper reported.\r\n>\r\n>The family members were then sent to prison camps.\r\n\r\nSee also: [3 Generations of Punishment](http://en.wikipedia.org/wiki/Kaechon_internment_camp#Human_rights_situation).","d":"Kim Jong-un’s Ex-Lover, Famous Singer in North Korea, Reportedly Executed by Firing Squad","u":"http://news.nationalpost.com/2013/08/29/kim-jong-uns-ex-lover-famous-singer-in-north-korea-reportedly-executed-by-firing-squad/"}]